//
//  StringValues.swift
//  AppSwiftUI
//
//  Created by Артем on 03.05.2023.
//

import Foundation

struct StringValues {
    
    static let nul = ""
    static let dateFormat = "yyyy-MM-dd"
    static let dateFormatLLLL = "LLLL"
    static let localeRU = "ru_RU"
    
    // Цвета
    static let backgroundColor = "BackgroundColor"
    static let goldButton = "ButtonColor"
    
    // Картинки (иконки)
    static let plus = "plus.circle.fill"
    static let chevronLeft = "chevron.left"
    static let chevronRight = "chevron.right"
    static let gearCircle = "gear.circle"
    
    // ForKey
    static let entries = "entries"
    static let moods = "moods"
    static let currentUser = "currentUser"
    
    // Разное
    static let textField = "Название (обязательное поле)"
    static let delete = "Удалить"
    static let entry = "Запись"
    static let save = "Сохранить"
    static let more = "Еще"
    
    // Раздел "Дневник"
    static let diary = "Дневник"
    static let diaryLabel = "С помощью этого дневника ты научишься ценить себя, свои усилия и развиваться, опираясь на свой опыт. Как именно? \nНажми на нужный тебе раздел, \nчтобы узнать о нем подробнее"

    // Раздел "Благодарности"
    static let gratitude = "Благодарности"
    static let gratitudeButton = "🙏🏻 Благодарности"
    static let gratitudeLabel = "Записывай ежедневно благодарности себе, своему окружению и миру. \nУже через несколько недель таких записей ты научишься осознанно замечать и радоваться тому, что с тобой происходит."
    
    // Раздел "Успехи"
    static let achievements = "Успехи"
    static let achievementsButton = "🏆 Успехи"
    static let achievementsLabel  = "Фиксируйте в дневнике от 3 успехов каждый день, опирайтесь на свои достижения и идите к новым целям. \nДа, именно, каждый день. Даже в самый сложный день найдутся успехи."
    
    // Раздел "Заметки"
    static let notes = "Заметки"
    static let notesButton = "📔 Заметки"
    
    
    // Раздел "Календарь настроения"
    static let moodCalendar = "Календарь настроения"
    static let moodLabel = "Здесь можно будет следить, как меняется твое настроение со временем \nКакое у тебя сегодня настроение?"
    static let smiley = ["😁", "🙂", "😐", "🙁", "😭"]
    static let allMonth = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
    
    // Раздел "Главная"
    static let home = "Главная"
    
    // Раздел "Цитаты"
    static let motivation = "Цитаты"
    
    // Раздел "Хорошие новости"
    static let goodNews = "Хорошие новости"
}
