//
//  Motivation.Model.swift
//  AppSwiftUI
//
//  Created by Артем on 31.03.2023.
//

import Foundation

struct Motivation {
    
    var randomQuote =  ["Единственный способ сделать что-то очень хорошо - любить то, что ты делаешь", "Стив Джобс"]
    
    let text = [
        "Никогда не делает ошибок только тот, кто не пробует ничего нового",
        "Либо напиши что-нибудь стоящее, либо делай что-нибудь, о чем стоит написать",
        "Определенность цели - отправная точка всех достижений",
        "Есть только один способ избежать критики: ничего не делайте, ничего не говорите и будьте никем",
        "Что такое деньги? Человек успешен, если утром он просыпается, вечером возвращается в постель, а в перерыве делает то, что ему нравится",
        "Я не жертва обстоятельств, я - результат моих решений",
        "Всегда опирайтесь на мысль о том, что ваше собственное решение добиться успеха намного важнее всего другого",
        "Выживает не самый сильный, а самый восприимчивый к переменам",
        "Делай все, что можешь, там, где ты находишься, используя все, что имеешь",
        "Наше сознание - это все. Вы становитесь тем, о чем думаете",
        "Если внутренний голос говорит вам, что вы не можете рисовать - рисуйте как можно больше, тогда этот голос затихнет",
        "Когда кажется, что весь мир настроен против вас, вспомните, что самолет взлетает не по ветру, а против него",
        "Либо вы управляете ваши днем, либо день управляет вами",
        "Идите уверенно по направлению к мечте. Живите той жизнью, которую вы сами себе придумали",
        "Ни разу не упасть - не самая большая заслуга в жизни. Главное каждый раз подниматься",
        "Я был поражен тем, как важно предпринимать действия. Недостаточно просто знать, нужно использовать знания. Мало хотеть чего-то, нужно делать",
        "Счастье не в том, чтобы делать всегда, что хочешь, а в том, чтобы всегда хотеть того, что делаешь",
        "Что разум человека может постигнуть и во что он может поверить, того он способен достичь",
        "Чтобы вести людей за собой, иди за ними",
        "Сложнее всего начать действовать, все остальное зависит только от упорства",
        "Ваше время ограничено, не тратьте его, живя чужой жизнью",
        "80% успеха - это появиться в нужном месте в нужное время",
        "Вы цените жизнь? Тогда не тратьте попусту время, потому что жизнь состоит именно из него",
        "Тот, кто каждое утро планирует ход дня и следует этому плану, держит в руке нить, которая ведет его по лабиринту напряженной жизни",
        "Я узнал, что успех измеряется не достигнутым положением, а препятствиями, которые пришлось преодолеть на пути к нему",
        "Если хотите по вечерам ложиться спать с чувством удовлетворения, просыпайтесь каждое утро с чувством решимости",
        "Мотивация заставляет нас начать что-то делать. Привычка же вынуждает продолжать это делать",
        "Как можно быстрее превращайте ваши масштабные мысли в масштабные действия. Не позволяйте ложным отговоркам затормозить вас. Отговорки - симптомы страха"
    ]
    
    let author = [
        "Альберт Эйнштейн",
        "Бенджамин Франклин",
        "Уильям Клемент Стоун",
        "Аристотель",
        "Боб Дилан",
        "Стивен Кови",
        "Авраам Линкольн",
        "Чарльз Дарвин",
        "Теодор Рузвельт",
        "Будда",
        "Винсент Ван Гог",
        "Генри Форд",
        "Джим Рон",
        "Генри Дэвид Торо",
        "Нельсон Мандела",
        "Леонардо да Винчи",
        "Лев Толстой",
        "Наполеон Хилл",
        "Лао-Цзы",
        "Амелия Эрхарт",
        "Стив Джобс",
        "Вуди Аллен",
        "Бенджамин Франклин",
        "Виктор Гюго",
        "Букер Вашингтон",
        "Джордж Лоример",
        "Джим Рон",
        "Дональд Трамп"
    ]
}
